# Terminal Emulator
cask "wezterm"

# Core Tools
brew "zsh"
brew "starship"
brew "atuin"
brew "zoxide"
brew "eza"
brew "bat"
brew "fd"
brew "ripgrep"
brew "git-delta"
brew "yazi"
brew "neovim"
brew "tmux"
brew "zellij"

# AI Tools
brew "aider"
brew "shell-gpt"

# Modern CLI Tools
brew "lazygit"
brew "gitui"
brew "bottom"
brew "bandwhich"
brew "tokei"
brew "hyperfine"
brew "tealdeer"
brew "glow"
brew "viu"
brew "chafa"

# Development Tools
brew "git"
brew "gh"
brew "node"
brew "python"
brew "rust"
brew "go"

# Fonts
tap "homebrew/cask-fonts"
cask "font-monaspace-nerd-font"